{"modelTopology":{"class_name":"Sequential","config":{"name":"sequential_26","layers":[{"class_name":"SimpleRNN","config":{"units":12,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"return_sequences":true,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false,"name":"simple_rnn_SimpleRNN51","trainable":true,"batch_input_shape":[null,null,1],"dtype":"float32"}},{"class_name":"SimpleRNN","config":{"units":12,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"return_sequences":false,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false,"name":"simple_rnn_SimpleRNN52","trainable":true}},{"class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense26","trainable":true}}]},"keras_version":"tfjs-layers 2.0.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v2.0.0","convertedBy":null,"weightsManifest":[{"paths":["./my-model.weights.bin"],"weights":[{"name":"simple_rnn_SimpleRNN51/kernel","shape":[1,12],"dtype":"float32"},{"name":"simple_rnn_SimpleRNN51/recurrent_kernel","shape":[12,12],"dtype":"float32"},{"name":"simple_rnn_SimpleRNN51/bias","shape":[12],"dtype":"float32"},{"name":"simple_rnn_SimpleRNN52/kernel","shape":[12,12],"dtype":"float32"},{"name":"simple_rnn_SimpleRNN52/recurrent_kernel","shape":[12,12],"dtype":"float32"},{"name":"simple_rnn_SimpleRNN52/bias","shape":[12],"dtype":"float32"},{"name":"dense_Dense26/kernel","shape":[12,1],"dtype":"float32"},{"name":"dense_Dense26/bias","shape":[1],"dtype":"float32"}]}]}